OdGiSubEntityTraits.setupForEntity
\details
Retrieves the set of SubEntityHints flags which can be used to provide more flexible tuning of
subSetAttributes traits processing.
\returns
SubEntityHints flags as the OdUInt32 value.

OdGiSubEntityTraits.popPaletteOverride
\details
Pop palette override from palette overrides stack.

OdGiSubEntityTraits.pushPaletteOverride(OdGiPalette!System.Runtime.CompilerServices.IsConst*)
\details
Push palette override into palette overrides stack.
\param pOverride [in]  New palette override.
\returns Returns true in case if palette overrides supported by underlying vectorization pipeline.

OdGiSubEntityTraits.popLineweightOverride
\details
Pops lineweight scale and style override from lineweight overrides stack.

OdGiSubEntityTraits.pushLineweightOverride(OdGiLineweightOverride!System.Runtime.CompilerServices.IsConst*)
\details
Pushes lineweight scale and style override into lineweight overrides stack.
\param pOverride [in]  New lineweight override.
\returns
true in case if lineweight overrides supported by underlying vectorization pipeline.

OdGiSubEntityTraits.auxData
\details
Retrieves pointer to auxiliary data context.
\returns
smart pointer to the auxiliary data context object.

OdGiSubEntityTraits.setAuxData(OdSmartPtr&lt;OdGiAuxiliaryData&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets pointer to auxiliary data context.
\param pAuxData [in]  pointer to auxiliary data context.

OdGiSubEntityTraits.fill
\details
Retrieves boundary filling parameters.
\returns
pointer to the instance of the OdGiFill class.

OdGiSubEntityTraits.setFill(OdGiFill!System.Runtime.CompilerServices.IsConst*)
\details
Sets boundary filling.
\param pFill [in]  Boundary filling parameters.

OdGiSubEntityTraits.lineStyleModifiers
\details
Retrieves pointer to the current Dgn Line Style modifiers structure.
\returns
pointer to the OdGiDgLinetypeModifiers.

OdGiSubEntityTraits.setLineStyleModifiers(OdGiDgLinetypeModifiers!System.Runtime.CompilerServices.IsConst*)
\details
Sets Dgn Line Style modifiers.
\param pLSMod [in]  Pointer to structure with Dgn Line Style modifiers.

OdGiSubEntityTraits.secondaryTrueColor
\details
Retrieves the current secondary color.
\returns
Secondary color as an instance of the OdCmEntityColor class.

OdGiSubEntityTraits.setSecondaryTrueColor(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the current secondary color from an OdCmEntityColor instance.
\param color [in]  OdCmEntityColor object.

OdGiSubEntityTraits.selectionFlags
\details
Retrieves the current SelectionFlags.
\returns
One of the SelectionFlags enumeration values.

OdGiSubEntityTraits.lockFlags
\details
Retrieves the current LockFlags bitmask.
\returns
Lock bit flags as the OdUInt32 value.

OdGiSubEntityTraits.drawFlags
\details
Retrieves the current DrawFlags bitmask.
\returns
Draw bit flags as the OdUInt32 value.

OdGiSubEntityTraits.transparency
\details
Retrieves the current transparency.
\returns
Transparency as an instance of the OdCmTransparency class.
\sa
Transparency Functionality as an Alpha-value
\sa
Transparency Functionality as an Integer-value

OdGiSubEntityTraits.plotStyleNameId
\details
Retrieves object ID of the the plot style name.
\returns
Pointer to the OdDbStub that represents a plot style name identifier.

OdGiSubEntityTraits.plotStyleNameType
\details
Retrieves the current PlotStyleName type.
\returns
One of the following values:
Name                           Value
kPlotStyleNameByLayer          0
kPlotStyleNameByBlock          1
kPlotStyleNameIsDictDefault    2
kPlotStyleNameById             3

OdGiSubEntityTraits.thickness
\details
Retrieves the current thickness.
\returns
Current thickness as a value of the double type.

OdGiSubEntityTraits.lineTypeScale
\details
Retrieves the current linetype scale.
\returns
Linetype scale as a value of the double type.
\sa
Specific Properties of Linetypes

OdGiSubEntityTraits.fillPlane(OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the normal to the current fill plane.
\param normal [out]  Receives the normal.
\returns
false in the current implementation.
\remarks
As implemented, this function does nothing but return false.
It will be fully implemented in a future release.

OdGiSubEntityTraits.fillType
\details
Retrieves the current fill type.
\returns
One of the following values:
Name              Value   Description
kOdGiFillAlways   1       Fill closed graphic primitives.
kOdGiFillNever    2       Don't fill closed graphic primitives.
Closed graphic primitives consist of the following:
* arcs with (OdGiArcType == kOdGiArcSector) || (OdGiArcType == kOdGiArcChord)
* circles
* meshes
* polygons
* shells

OdGiSubEntityTraits.lineType
\details
Retrieves the current linetype.
\returns
Pointer to the OdDbStub that represents linetype identifier.
\sa
Working with Linetypes

OdGiSubEntityTraits.trueColor
\details
Retrieves the current color.
\returns
Current color as an OdCmEntityColor instance.
\returns
Color index as OdUInt16 value.
\sa
Working with Colors

OdGiSubEntityTraits.color
\details
Retrieves the current color index (ACI).
\returns
Color index as OdUInt16 value.
\remarks
color() returns one of the following:
Name              Value   Description
kACIbyBlock       0       ByBlock.
kACIforeground    7       Foreground color.
kACIbyLayer       256     ByLayer.
kACIRed           1       Red.
kACIYellow        2       Yellow.
kACIGreen         3       Green.
kACICyan          4       Cyan.
kACIBlue          5       Blue.
kACIMagenta       6       Magenta.
..                8-255   Defined by AcadPalette.h
\sa
Working with Colors

OdGiSubEntityTraits.setSelectionFlags(OdGiSubEntityTraits.SelectionFlags)
\details
Sets the selection flags.
\param selectionFlags [in]  Input SelectionFlags.

OdGiSubEntityTraits.setLockFlags(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the lock flags.
\param lockFlags [in]  Input bitmask with LockFlags.

OdGiSubEntityTraits.setDrawFlags(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the drawing flags.
\param drawFlags [in]  Input bitmask with DrawFlags.

OdGiSubEntityTraits.setTransparency(OdCmTransparency!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the current transparency.
\param transparency [in]  OdCmTransparency object.
\sa
Transparency Functionality as an Alpha-value
\sa
Transparency Functionality as an Integer-value

OdGiSubEntityTraits.setPlotStyleName(OdDb.PlotStyleNameType,OdDbStub*)
\details
Sets the current PlotStyleName.
\param plotStyleNameType [in]  Plot Style Name Type.
\param plotStyleNameId [in]  Object ID of the Plot Style Name.
\remarks
plotStyleNameId is used only when plotStyleNameType == kPlotStyleNameById.
plotStyleNameType must be one of the following:
Name                           Value
kPlotStyleNameByLayer          0
kPlotStyleNameByBlock          1
kPlotStyleNameIsDictDefault    2
kPlotStyleNameById             3

OdGiSubEntityTraits.setThickness(System.Double)
\details
Sets the current thickness.
\param thickness [in]  Thickness.

OdGiSubEntityTraits.setLineTypeScale(System.Double)
\details
Sets the current linetype scale.
\param lineTypeScale [in]  Linetype scale factor.
\sa
Specific Properties of Linetypes

OdGiSubEntityTraits.setFillPlane(OdGeVector3d!System.Runtime.CompilerServices.IsConst*)
\details
Sets the current fill plane.
\param pNormal [in]  Pointer to the normal to the plane.
\remarks
As implemented, this function does nothing but return.
It will be fully implemented in a future release.

OdGiSubEntityTraits.setFillType(OdGiFillType)
\details
Sets the current fill type.
\param fillType [in]  Fill type.
\remarks
fillType must be one of the following:
Name              Value   Description
kOdGiFillAlways   1       Fill closed graphic primitives.
kOdGiFillNever    2       Don't fill closed graphic primitives.
Closed graphic primitives consist of the following:
* arcs with (OdGiArcType == kOdGiArcSector) || (OdGiArcType == kOdGiArcChord)
* circles
* meshes
* polygons
* shells

OdGiSubEntityTraits.setSelectionMarker(System.Int64)
\details
Sets the current selection marker.
\param marker [in]  Selection marker.

OdGiSubEntityTraits.setLineType(OdDbStub*)
\details
Sets the current linetype.
\param lineTypeId [in]  Object ID of the LinetypeTableRecord.
\sa
Working with Linetypes

OdGiSubEntityTraits.setTrueColor(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the current color from an OdCmEntityColor instance.
\param color [in]  OdCmEntityColor object.
\sa
Working with Colors

OdGiSubEntityTraits.setColor(System.UInt16)
\details
Sets the current color index (ACI).
\param color [in]  Color index.
\remarks
color must be one of the following:
Name              Value   Description
kACIbyBlock       0       ByBlock.
kACIforeground    7       Foreground color.
kACIbyLayer       256     ByLayer.
kACIRed           1       Red.
kACIYellow        2       Yellow.
kACIGreen         3       Green.
kACICyan          4       Cyan.
kACIBlue          5       Blue.
kACIMagenta       6       Magenta.
..                8-255   Defined by AcadPalette.h
\sa
Working with Colors